patches/amg2013/ArgErrorCommunicator1Mutation.1.patch
diff --git a/parcsr_mv/par_csr_assumed_part.c b/parcsr_mv/par_csr_assumed_part.c
index 882842b..6dba554 100644
--- a/parcsr_mv/par_csr_assumed_part.c
+++ b/parcsr_mv/par_csr_assumed_part.c
@@ -186,7 +186,7 @@ hypre_LocateAssummedPartition(MPI_Comm comm, HYPRE_BigInt row_start, HYPRE_BigIn
    for (i=0; i< contact_list_length; i++) 
    {
       MPI_Isend(&CONTACT(i,1) ,2, MPI_HYPRE_BIG_INT, CONTACT(i,0), flag1 , 
-                 comm, &requests[i]);
+                 MPI_COMM_NULL, &requests[i]);
    }
 
    /*-----------------------------------------------------------
