patches/amg2013/ArgErrorCommunicator2Mutation.1.patch
diff --git a/parcsr_mv/par_csr_assumed_part.c b/parcsr_mv/par_csr_assumed_part.c
index 882842b..02bf654 100644
--- a/parcsr_mv/par_csr_assumed_part.c
+++ b/parcsr_mv/par_csr_assumed_part.c
@@ -185,8 +185,8 @@ hypre_LocateAssummedPartition(MPI_Comm comm, HYPRE_BigInt row_start, HYPRE_BigIn
    /*send out messages */
    for (i=0; i< contact_list_length; i++) 
    {
-      MPI_Isend(&CONTACT(i,1) ,2, MPI_HYPRE_BIG_INT, CONTACT(i,0), flag1 , 
-                 comm, &requests[i]);
+      MPI_Comm null_comm_abc1 = NULL;MPI_Isend(&CONTACT(i,1) ,2, MPI_HYPRE_BIG_INT, CONTACT(i,0), flag1 , 
+                 null_comm_abc1, &requests[i]);
    }
 
    /*-----------------------------------------------------------
