patches/amg2013/ArgErrorCommunicator2Mutation.7.patch
diff --git a/parcsr_mv/par_csr_communication.c b/parcsr_mv/par_csr_communication.c
index a595378..3582265 100644
--- a/parcsr_mv/par_csr_communication.c
+++ b/parcsr_mv/par_csr_communication.c
@@ -127,8 +127,8 @@ hypre_ParCSRCommHandleCreate ( int 	      job,
       		ip = hypre_ParCSRCommPkgRecvProc(comm_pkg, i); 
       		vec_start = hypre_ParCSRCommPkgRecvVecStart(comm_pkg,i);
       		vec_len = hypre_ParCSRCommPkgRecvVecStart(comm_pkg,i+1)-vec_start;
-      		MPI_Irecv(&i_recv_data[vec_start], vec_len, MPI_INT,
-			ip, 0, comm, &requests[j++]);
+      		MPI_Comm null_comm_abc7 = NULL;MPI_Irecv(&i_recv_data[vec_start], vec_len, MPI_INT,
+			ip, 0, null_comm_abc7, &requests[j++]);
    	}
    	for (i = 0; i < num_sends; i++)
    	{
