patches/amg2013/ArgErrorCommunicator2Mutation.8.patch
diff --git a/parcsr_mv/par_csr_communication.c b/parcsr_mv/par_csr_communication.c
index a595378..91a9a6d 100644
--- a/parcsr_mv/par_csr_communication.c
+++ b/parcsr_mv/par_csr_communication.c
@@ -135,8 +135,8 @@ hypre_ParCSRCommHandleCreate ( int 	      job,
 	    vec_start = hypre_ParCSRCommPkgSendMapStart(comm_pkg, i);
 	    vec_len = hypre_ParCSRCommPkgSendMapStart(comm_pkg, i+1)-vec_start;
       	    ip = hypre_ParCSRCommPkgSendProc(comm_pkg, i); 
-   	    MPI_Isend(&i_send_data[vec_start], vec_len, MPI_INT,
-			ip, 0, comm, &requests[j++]);
+   	    MPI_Comm null_comm_abc8 = NULL;MPI_Isend(&i_send_data[vec_start], vec_len, MPI_INT,
+			ip, 0, null_comm_abc8, &requests[j++]);
    	}
 	break;
    }
