patches/amg2013/ArgErrorCount1Mutation.8.patch
diff --git a/parcsr_mv/par_csr_communication.c b/parcsr_mv/par_csr_communication.c
index a595378..e6bf50f 100644
--- a/parcsr_mv/par_csr_communication.c
+++ b/parcsr_mv/par_csr_communication.c
@@ -135,7 +135,7 @@ hypre_ParCSRCommHandleCreate ( int 	      job,
 	    vec_start = hypre_ParCSRCommPkgSendMapStart(comm_pkg, i);
 	    vec_len = hypre_ParCSRCommPkgSendMapStart(comm_pkg, i+1)-vec_start;
       	    ip = hypre_ParCSRCommPkgSendProc(comm_pkg, i); 
-   	    MPI_Isend(&i_send_data[vec_start], vec_len, MPI_INT,
+   	    MPI_Isend(&i_send_data[vec_start], 2 * vec_len, MPI_INT,
 			ip, 0, comm, &requests[j++]);
    	}
 	break;
