patches/amg2013/ArgErrorNullBufferMutation.4.patch
diff --git a/parcsr_mv/par_csr_communication.c b/parcsr_mv/par_csr_communication.c
index a595378..70be47b 100644
--- a/parcsr_mv/par_csr_communication.c
+++ b/parcsr_mv/par_csr_communication.c
@@ -91,7 +91,7 @@ hypre_ParCSRCommHandleCreate ( int 	      job,
 	    vec_start = hypre_ParCSRCommPkgSendMapStart(comm_pkg, i);
 	    vec_len = hypre_ParCSRCommPkgSendMapStart(comm_pkg, i+1)-vec_start;
       	    ip = hypre_ParCSRCommPkgSendProc(comm_pkg, i); 
-   	    MPI_Isend(&d_send_data[vec_start], vec_len, MPI_DOUBLE,
+   	    MPI_Isend(NULL, vec_len, MPI_DOUBLE,
 			ip, 0, comm, &requests[j++]);
    	}
 	break;
