patches/amg2013/ArgErrorNullRequestMutation.9.patch
diff --git a/parcsr_mv/par_csr_communication.c b/parcsr_mv/par_csr_communication.c
index a595378..fbf81b4 100644
--- a/parcsr_mv/par_csr_communication.c
+++ b/parcsr_mv/par_csr_communication.c
@@ -158,7 +158,7 @@ hypre_ParCSRCommHandleCreate ( int 	      job,
       		vec_start = hypre_ParCSRCommPkgRecvVecStart(comm_pkg,i);
       		vec_len = hypre_ParCSRCommPkgRecvVecStart(comm_pkg,i+1)-vec_start;
       		MPI_Isend(&i_send_data[vec_start], vec_len, MPI_INT,
-			ip, 0, comm, &requests[j++]);
+			ip, 0, comm, NULL);
    	}
 	break;
    }
