patches/amg2013/ArgErrorOp2Mutation.2.patch
diff --git a/parcsr_ls/par_stats.c b/parcsr_ls/par_stats.c
index ab9454a..9462a5c 100644
--- a/parcsr_ls/par_stats.c
+++ b/parcsr_ls/par_stats.c
@@ -592,7 +592,7 @@ hypre_BoomerAMGSetupStats( void               *amg_vdata,
       send_buff[4] = - min_weight;
       send_buff[5] = max_weight;
 
-      MPI_Reduce(send_buff, gather_buff, 6, MPI_DOUBLE, MPI_MAX, 0, comm);
+      MPI_Reduce(send_buff, gather_buff, 6, MPI_DOUBLE, MPI_REPLACE, 0, comm);
 
       if (my_id == 0)
       {
