patches/amg2013/ArgErrorRank1Mutation.2.patch
diff --git a/parcsr_mv/par_csr_assumed_part.c b/parcsr_mv/par_csr_assumed_part.c
index 882842b..b4b30f1 100644
--- a/parcsr_mv/par_csr_assumed_part.c
+++ b/parcsr_mv/par_csr_assumed_part.c
@@ -265,7 +265,7 @@ hypre_LocateAssummedPartition(MPI_Comm comm, HYPRE_BigInt row_start, HYPRE_BigIn
 
    while (rows_found != locate_row_count) {
   
-      MPI_Recv( tmp_range, 2 , MPI_HYPRE_BIG_INT, MPI_ANY_SOURCE, 
+      int illegal_rank_abc2; MPI_Comm_size(comm, &illegal_rank_abc2);MPI_Recv( tmp_range, 2 , MPI_HYPRE_BIG_INT, illegal_rank_abc2, 
                 flag1 , comm, &status0);
      
       if (part->length==part->storage_length)
