patches/amg2013/ArgErrorRank1Mutation.4.patch
diff --git a/parcsr_mv/par_csr_communication.c b/parcsr_mv/par_csr_communication.c
index a595378..487070f 100644
--- a/parcsr_mv/par_csr_communication.c
+++ b/parcsr_mv/par_csr_communication.c
@@ -91,8 +91,8 @@ hypre_ParCSRCommHandleCreate ( int 	      job,
 	    vec_start = hypre_ParCSRCommPkgSendMapStart(comm_pkg, i);
 	    vec_len = hypre_ParCSRCommPkgSendMapStart(comm_pkg, i+1)-vec_start;
       	    ip = hypre_ParCSRCommPkgSendProc(comm_pkg, i); 
-   	    MPI_Isend(&d_send_data[vec_start], vec_len, MPI_DOUBLE,
-			ip, 0, comm, &requests[j++]);
+   	    int illegal_rank_abc4; MPI_Comm_size(comm, &illegal_rank_abc4);MPI_Isend(&d_send_data[vec_start], vec_len, MPI_DOUBLE,
+			illegal_rank_abc4, 0, comm, &requests[j++]);
    	}
 	break;
    }
