patches/amg2013/ArgErrorRank1Mutation.9.patch
diff --git a/parcsr_mv/par_csr_communication.c b/parcsr_mv/par_csr_communication.c
index a595378..61f14e5 100644
--- a/parcsr_mv/par_csr_communication.c
+++ b/parcsr_mv/par_csr_communication.c
@@ -149,8 +149,8 @@ hypre_ParCSRCommHandleCreate ( int 	      job,
 	    vec_start = hypre_ParCSRCommPkgSendMapStart(comm_pkg, i);
 	    vec_len = hypre_ParCSRCommPkgSendMapStart(comm_pkg, i+1) - vec_start;
       	    ip = hypre_ParCSRCommPkgSendProc(comm_pkg, i); 
-   	    MPI_Irecv(&i_recv_data[vec_start], vec_len, MPI_INT,
-			ip, 0, comm, &requests[j++]);
+   	    int illegal_rank_abc9; MPI_Comm_size(comm, &illegal_rank_abc9);MPI_Irecv(&i_recv_data[vec_start], vec_len, MPI_INT,
+			illegal_rank_abc9, 0, comm, &requests[j++]);
    	}
    	for (i = 0; i < num_recvs; i++)
    	{
