patches/amg2013/ArgErrorRank2Mutation.6.patch
diff --git a/parcsr_mv/par_csr_communication.c b/parcsr_mv/par_csr_communication.c
index a595378..3646f4e 100644
--- a/parcsr_mv/par_csr_communication.c
+++ b/parcsr_mv/par_csr_communication.c
@@ -114,7 +114,7 @@ hypre_ParCSRCommHandleCreate ( int 	      job,
       		vec_start = hypre_ParCSRCommPkgRecvVecStart(comm_pkg,i);
       		vec_len = hypre_ParCSRCommPkgRecvVecStart(comm_pkg,i+1)-vec_start;
       		MPI_Isend(&d_send_data[vec_start], vec_len, MPI_DOUBLE,
-			ip, 0, comm, &requests[j++]);
+			-2-ip, 0, comm, &requests[j++]);
    	}
 	break;
    }
