patches/amg2013/ArgErrorRank2Mutation.7.patch
diff --git a/parcsr_mv/par_csr_communication.c b/parcsr_mv/par_csr_communication.c
index a595378..88dd098 100644
--- a/parcsr_mv/par_csr_communication.c
+++ b/parcsr_mv/par_csr_communication.c
@@ -128,7 +128,7 @@ hypre_ParCSRCommHandleCreate ( int 	      job,
       		vec_start = hypre_ParCSRCommPkgRecvVecStart(comm_pkg,i);
       		vec_len = hypre_ParCSRCommPkgRecvVecStart(comm_pkg,i+1)-vec_start;
       		MPI_Irecv(&i_recv_data[vec_start], vec_len, MPI_INT,
-			ip, 0, comm, &requests[j++]);
+			-2-ip, 0, comm, &requests[j++]);
    	}
    	for (i = 0; i < num_sends; i++)
    	{
