patches/amg2013/ArgErrorRoot1Mutation.3.patch
diff --git a/parcsr_ls/gen_redcs_mat.c b/parcsr_ls/gen_redcs_mat.c
index aa6df20..fa1097e 100644
--- a/parcsr_ls/gen_redcs_mat.c
+++ b/parcsr_ls/gen_redcs_mat.c
@@ -343,7 +343,7 @@ hypre_seqAMGCycle( hypre_ParAMGData *amg_data,
       if (redundant)
          MPI_Allgather(&local_info, 1, MPI_INT, info, 1, MPI_INT, new_comm);
       else
-         MPI_Gather(&local_info, 1, MPI_INT, info, 1, MPI_INT, 0, new_comm);
+         {int negative_dest_1233 = -1;MPI_Gather(&local_info, 1, MPI_INT, info, 1, MPI_INT, negative_dest_1233, new_comm);}
 
       if (redundant || my_id ==0)
       {
