patches/amg2013/ArgErrorRoot1Mutation.4.patch
diff --git a/parcsr_ls/par_stats.c b/parcsr_ls/par_stats.c
index ab9454a..8c863ff 100644
--- a/parcsr_ls/par_stats.c
+++ b/parcsr_ls/par_stats.c
@@ -401,7 +401,7 @@ hypre_BoomerAMGSetupStats( void               *amg_vdata,
        send_buff[2] = - min_rowsum;
        send_buff[3] = max_rowsum;
 
-       MPI_Reduce(send_buff, gather_buff, 4, MPI_DOUBLE, MPI_MAX, 0, comm);
+       int negative_dest_1234 = -1;MPI_Reduce(send_buff, gather_buff, 4, MPI_DOUBLE, MPI_MAX, negative_dest_1234, comm);
        
        if (my_id ==0)
        {
