patches/amg2013/ArgErrorRoot2Mutation.2.patch
diff --git a/parcsr_ls/gen_redcs_mat.c b/parcsr_ls/gen_redcs_mat.c
index aa6df20..adef5d8 100644
--- a/parcsr_ls/gen_redcs_mat.c
+++ b/parcsr_ls/gen_redcs_mat.c
@@ -93,7 +93,7 @@ int hypre_seqAMGSetup( hypre_ParAMGData *amg_data,
          if (redundant)
             MPI_Allgather(&num_rows, 1, MPI_INT, info, 1, MPI_INT, new_comm);
          else
-            MPI_Gather(&num_rows, 1, MPI_INT, info, 1, MPI_INT, 0, new_comm);
+            {unsigned int too_large_dest_1232 = -1;MPI_Gather(&num_rows, 1, MPI_INT, info, 1, MPI_INT, too_large_dest_1232, new_comm);}
 
          /* alloc space in seq data structure only for participating procs*/
          if (redundant || my_id == 0)
