patches/amg2013/ArgErrorTag2Mutation.10.patch
diff --git a/parcsr_mv/par_csr_communication.c b/parcsr_mv/par_csr_communication.c
index a595378..b878d92 100644
--- a/parcsr_mv/par_csr_communication.c
+++ b/parcsr_mv/par_csr_communication.c
@@ -157,8 +157,8 @@ hypre_ParCSRCommHandleCreate ( int 	      job,
       		ip = hypre_ParCSRCommPkgRecvProc(comm_pkg, i); 
       		vec_start = hypre_ParCSRCommPkgRecvVecStart(comm_pkg,i);
       		vec_len = hypre_ParCSRCommPkgRecvVecStart(comm_pkg,i+1)-vec_start;
-      		MPI_Isend(&i_send_data[vec_start], vec_len, MPI_INT,
-			ip, 0, comm, &requests[j++]);
+      		long long illegal_tag_abc10 = MPI_TAG_UB + 1;MPI_Isend(&i_send_data[vec_start], vec_len, MPI_INT,
+			ip, illegal_tag_abc10, comm, &requests[j++]);
    	}
 	break;
    }
