patches/amg2013/ArgErrorTag2Mutation.3.patch
diff --git a/parcsr_mv/par_csr_communication.c b/parcsr_mv/par_csr_communication.c
index a595378..11e1579 100644
--- a/parcsr_mv/par_csr_communication.c
+++ b/parcsr_mv/par_csr_communication.c
@@ -83,8 +83,8 @@ hypre_ParCSRCommHandleCreate ( int 	      job,
       		ip = hypre_ParCSRCommPkgRecvProc(comm_pkg, i); 
       		vec_start = hypre_ParCSRCommPkgRecvVecStart(comm_pkg,i);
       		vec_len = hypre_ParCSRCommPkgRecvVecStart(comm_pkg,i+1)-vec_start;
-      		MPI_Irecv(&d_recv_data[vec_start], vec_len, MPI_DOUBLE,
-			ip, 0, comm, &requests[j++]);
+      		long long illegal_tag_abc3 = MPI_TAG_UB + 1;MPI_Irecv(&d_recv_data[vec_start], vec_len, MPI_DOUBLE,
+			ip, illegal_tag_abc3, comm, &requests[j++]);
    	}
    	for (i = 0; i < num_sends; i++)
    	{
