patches/amg2013/ArgErrorTag2Mutation.5.patch
diff --git a/parcsr_mv/par_csr_communication.c b/parcsr_mv/par_csr_communication.c
index a595378..bfaa421 100644
--- a/parcsr_mv/par_csr_communication.c
+++ b/parcsr_mv/par_csr_communication.c
@@ -105,8 +105,8 @@ hypre_ParCSRCommHandleCreate ( int 	      job,
 	    vec_start = hypre_ParCSRCommPkgSendMapStart(comm_pkg, i);
 	    vec_len = hypre_ParCSRCommPkgSendMapStart(comm_pkg, i+1) - vec_start;
       	    ip = hypre_ParCSRCommPkgSendProc(comm_pkg, i); 
-   	    MPI_Irecv(&d_recv_data[vec_start], vec_len, MPI_DOUBLE,
-			ip, 0, comm, &requests[j++]);
+   	    long long illegal_tag_abc5 = MPI_TAG_UB + 1;MPI_Irecv(&d_recv_data[vec_start], vec_len, MPI_DOUBLE,
+			ip, illegal_tag_abc5, comm, &requests[j++]);
    	}
    	for (i = 0; i < num_recvs; i++)
    	{
