patches/amg2013/ArgErrorType2Mutation.10.patch
diff --git a/parcsr_mv/par_csr_communication.c b/parcsr_mv/par_csr_communication.c
index a595378..c93b560 100644
--- a/parcsr_mv/par_csr_communication.c
+++ b/parcsr_mv/par_csr_communication.c
@@ -157,7 +157,7 @@ hypre_ParCSRCommHandleCreate ( int 	      job,
       		ip = hypre_ParCSRCommPkgRecvProc(comm_pkg, i); 
       		vec_start = hypre_ParCSRCommPkgRecvVecStart(comm_pkg,i);
       		vec_len = hypre_ParCSRCommPkgRecvVecStart(comm_pkg,i+1)-vec_start;
-      		MPI_Isend(&i_send_data[vec_start], vec_len, MPI_INT,
+      		MPI_Isend(&i_send_data[vec_start], vec_len, NULL,
 			ip, 0, comm, &requests[j++]);
    	}
 	break;
