patches/amg2013/ArgMismatchCommunicatorMutation.1.patch
diff --git a/parcsr_mv/par_csr_assumed_part.c b/parcsr_mv/par_csr_assumed_part.c
index 882842b..58537d1 100644
--- a/parcsr_mv/par_csr_assumed_part.c
+++ b/parcsr_mv/par_csr_assumed_part.c
@@ -185,8 +185,8 @@ hypre_LocateAssummedPartition(MPI_Comm comm, HYPRE_BigInt row_start, HYPRE_BigIn
    /*send out messages */
    for (i=0; i< contact_list_length; i++) 
    {
-      MPI_Isend(&CONTACT(i,1) ,2, MPI_HYPRE_BIG_INT, CONTACT(i,0), flag1 , 
-                 comm, &requests[i]);
+      int rank_abc1;MPI_Comm_rank(MPI_COMM_WORLD, &rank_abc1);int color_abc1 = rank_abc1 / 1;MPI_Comm new_wrong_communicator_abc1;MPI_Comm_split(MPI_COMM_WORLD, color_abc1, rank_abc1, &new_wrong_communicator_abc1);MPI_Isend(&CONTACT(i,1) ,2, MPI_HYPRE_BIG_INT, CONTACT(i,0), flag1 , 
+                 new_wrong_communicator_abc1, &requests[i]);
    }
 
    /*-----------------------------------------------------------
