patches/amg2013/ArgMismatchCommunicatorMutation.2.patch
diff --git a/parcsr_mv/par_csr_communication.c b/parcsr_mv/par_csr_communication.c
index a595378..f859c7f 100644
--- a/parcsr_mv/par_csr_communication.c
+++ b/parcsr_mv/par_csr_communication.c
@@ -91,8 +91,8 @@ hypre_ParCSRCommHandleCreate ( int 	      job,
 	    vec_start = hypre_ParCSRCommPkgSendMapStart(comm_pkg, i);
 	    vec_len = hypre_ParCSRCommPkgSendMapStart(comm_pkg, i+1)-vec_start;
       	    ip = hypre_ParCSRCommPkgSendProc(comm_pkg, i); 
-   	    MPI_Isend(&d_send_data[vec_start], vec_len, MPI_DOUBLE,
-			ip, 0, comm, &requests[j++]);
+   	    int rank_abc2;MPI_Comm_rank(MPI_COMM_WORLD, &rank_abc2);int color_abc2 = rank_abc2 / 1;MPI_Comm new_wrong_communicator_abc2;MPI_Comm_split(MPI_COMM_WORLD, color_abc2, rank_abc2, &new_wrong_communicator_abc2);MPI_Isend(&d_send_data[vec_start], vec_len, MPI_DOUBLE,
+			ip, 0, new_wrong_communicator_abc2, &requests[j++]);
    	}
 	break;
    }
