patches/amg2013/ArgMismatchCommunicatorMutation.3.patch
diff --git a/parcsr_mv/par_csr_communication.c b/parcsr_mv/par_csr_communication.c
index a595378..4cf4725 100644
--- a/parcsr_mv/par_csr_communication.c
+++ b/parcsr_mv/par_csr_communication.c
@@ -113,8 +113,8 @@ hypre_ParCSRCommHandleCreate ( int 	      job,
       		ip = hypre_ParCSRCommPkgRecvProc(comm_pkg, i); 
       		vec_start = hypre_ParCSRCommPkgRecvVecStart(comm_pkg,i);
       		vec_len = hypre_ParCSRCommPkgRecvVecStart(comm_pkg,i+1)-vec_start;
-      		MPI_Isend(&d_send_data[vec_start], vec_len, MPI_DOUBLE,
-			ip, 0, comm, &requests[j++]);
+      		int rank_abc3;MPI_Comm_rank(MPI_COMM_WORLD, &rank_abc3);int color_abc3 = rank_abc3 / 1;MPI_Comm new_wrong_communicator_abc3;MPI_Comm_split(MPI_COMM_WORLD, color_abc3, rank_abc3, &new_wrong_communicator_abc3);MPI_Isend(&d_send_data[vec_start], vec_len, MPI_DOUBLE,
+			ip, 0, new_wrong_communicator_abc3, &requests[j++]);
    	}
 	break;
    }
