patches/amg2013/ArgMismatchCommunicatorMutation.4.patch
diff --git a/parcsr_mv/par_csr_communication.c b/parcsr_mv/par_csr_communication.c
index a595378..f7a95be 100644
--- a/parcsr_mv/par_csr_communication.c
+++ b/parcsr_mv/par_csr_communication.c
@@ -135,8 +135,8 @@ hypre_ParCSRCommHandleCreate ( int 	      job,
 	    vec_start = hypre_ParCSRCommPkgSendMapStart(comm_pkg, i);
 	    vec_len = hypre_ParCSRCommPkgSendMapStart(comm_pkg, i+1)-vec_start;
       	    ip = hypre_ParCSRCommPkgSendProc(comm_pkg, i); 
-   	    MPI_Isend(&i_send_data[vec_start], vec_len, MPI_INT,
-			ip, 0, comm, &requests[j++]);
+   	    int rank_abc4;MPI_Comm_rank(MPI_COMM_WORLD, &rank_abc4);int color_abc4 = rank_abc4 / 1;MPI_Comm new_wrong_communicator_abc4;MPI_Comm_split(MPI_COMM_WORLD, color_abc4, rank_abc4, &new_wrong_communicator_abc4);MPI_Isend(&i_send_data[vec_start], vec_len, MPI_INT,
+			ip, 0, new_wrong_communicator_abc4, &requests[j++]);
    	}
 	break;
    }
