patches/amg2013/ArgMismatchCommunicatorMutation.5.patch
diff --git a/parcsr_mv/par_csr_communication.c b/parcsr_mv/par_csr_communication.c
index a595378..a088df1 100644
--- a/parcsr_mv/par_csr_communication.c
+++ b/parcsr_mv/par_csr_communication.c
@@ -157,8 +157,8 @@ hypre_ParCSRCommHandleCreate ( int 	      job,
       		ip = hypre_ParCSRCommPkgRecvProc(comm_pkg, i); 
       		vec_start = hypre_ParCSRCommPkgRecvVecStart(comm_pkg,i);
       		vec_len = hypre_ParCSRCommPkgRecvVecStart(comm_pkg,i+1)-vec_start;
-      		MPI_Isend(&i_send_data[vec_start], vec_len, MPI_INT,
-			ip, 0, comm, &requests[j++]);
+      		int rank_abc5;MPI_Comm_rank(MPI_COMM_WORLD, &rank_abc5);int color_abc5 = rank_abc5 / 1;MPI_Comm new_wrong_communicator_abc5;MPI_Comm_split(MPI_COMM_WORLD, color_abc5, rank_abc5, &new_wrong_communicator_abc5);MPI_Isend(&i_send_data[vec_start], vec_len, MPI_INT,
+			ip, 0, new_wrong_communicator_abc5, &requests[j++]);
    	}
 	break;
    }
