patches/amg2013/ArgMismatchCommunicatorMutation.8.patch
diff --git a/parcsr_mv/par_csr_communication.c b/parcsr_mv/par_csr_communication.c
index a595378..7ff14fd 100644
--- a/parcsr_mv/par_csr_communication.c
+++ b/parcsr_mv/par_csr_communication.c
@@ -457,8 +457,8 @@ hypre_MatvecCommPkgCreate_core (
       vec_start = recv_vec_starts[i];
       vec_len = recv_vec_starts[i+1] - vec_start;
       ip = recv_procs[i];
-      MPI_Isend(&col_map_offd[vec_start], vec_len, MPI_HYPRE_BIG_INT,
-                        ip, 0, comm, &requests[j++]);
+      int rank_abc8;MPI_Comm_rank(MPI_COMM_WORLD, &rank_abc8);int color_abc8 = rank_abc8 / 1;MPI_Comm new_wrong_communicator_abc8;MPI_Comm_split(MPI_COMM_WORLD, color_abc8, rank_abc8, &new_wrong_communicator_abc8);MPI_Isend(&col_map_offd[vec_start], vec_len, MPI_HYPRE_BIG_INT,
+                        ip, 0, new_wrong_communicator_abc8, &requests[j++]);
    }
 
    if (num_requests)
