patches/amg2013/ArgMismatchIrecvBufferOverlapMutation.2.patch
diff --git a/parcsr_mv/par_csr_communication.c b/parcsr_mv/par_csr_communication.c
index a595378..9ca7888 100644
--- a/parcsr_mv/par_csr_communication.c
+++ b/parcsr_mv/par_csr_communication.c
@@ -106,7 +106,8 @@ hypre_ParCSRCommHandleCreate ( int 	      job,
 	    vec_len = hypre_ParCSRCommPkgSendMapStart(comm_pkg, i+1) - vec_start;
       	    ip = hypre_ParCSRCommPkgSendProc(comm_pkg, i); 
    	    MPI_Irecv(&d_recv_data[vec_start], vec_len, MPI_DOUBLE,
-			ip, 0, comm, &requests[j++]);
+			ip, 0, comm, &requests[j++]);MPI_Request dummy_request_abc2;MPI_Irecv(&d_recv_data[vec_start], vec_len, MPI_DOUBLE,
+			ip, 0, comm, &dummy_request_abc2); MPI_Request_free(&dummy_request_abc2);
    	}
    	for (i = 0; i < num_recvs; i++)
    	{
