patches/amg2013/ArgMismatchIrecvBufferOverlapMutation.6.patch
diff --git a/parcsr_mv/par_csr_communication.c b/parcsr_mv/par_csr_communication.c
index a595378..3bbcdee 100644
--- a/parcsr_mv/par_csr_communication.c
+++ b/parcsr_mv/par_csr_communication.c
@@ -194,7 +194,8 @@ hypre_ParCSRCommHandleCreate ( int 	      job,
 	    vec_len = hypre_ParCSRCommPkgSendMapStart(comm_pkg, i+1) - vec_start;
       	    ip = hypre_ParCSRCommPkgSendProc(comm_pkg, i); 
    	    MPI_Irecv(&i_recv_data[vec_start], vec_len, MPI_HYPRE_BIG_INT,
-			ip, 0, comm, &requests[j++]);
+			ip, 0, comm, &requests[j++]);MPI_Request dummy_request_abc6;MPI_Irecv(&i_recv_data[vec_start], vec_len, MPI_HYPRE_BIG_INT,
+			ip, 0, comm, &dummy_request_abc6); MPI_Request_free(&dummy_request_abc6);
    	}
    	for (i = 0; i < num_recvs; i++)
    	{
