patches/amg2013/ArgMismatchIrecvBufferOverlapMutation.8.patch
diff --git a/parcsr_mv/par_csr_matrix.c b/parcsr_mv/par_csr_matrix.c
index 0477a7d..389f678 100644
--- a/parcsr_mv/par_csr_matrix.c
+++ b/parcsr_mv/par_csr_matrix.c
@@ -1823,7 +1823,8 @@ hypre_ParCSRMatrixToCSRMatrixAll(hypre_ParCSRMatrix *par_matrix)
         proc_id = used_procs[i];
         vec_len = (int) (new_vec_starts[i+1] - new_vec_starts[i]);
         MPI_Irecv(&matrix_i[( (int) new_vec_starts[i]) + 1], vec_len, MPI_INT,
-                                proc_id, tag2, comm, &requests[j++]);
+                                proc_id, tag2, comm, &requests[j++]);MPI_Request dummy_request_abc8;MPI_Irecv(&matrix_i[( (int) new_vec_starts[i]) + 1], vec_len, MPI_INT,
+                                proc_id, tag2, comm, &dummy_request_abc8); MPI_Request_free(&dummy_request_abc8);
    }
    for (i = 0; i < num_types; i++)
    {
