patches/amg2013/ArgMismatchIrecvBufferOverlapMutation.9.patch
diff --git a/parcsr_mv/par_csr_matrix.c b/parcsr_mv/par_csr_matrix.c
index 0477a7d..ef24e6e 100644
--- a/parcsr_mv/par_csr_matrix.c
+++ b/parcsr_mv/par_csr_matrix.c
@@ -1866,7 +1866,8 @@ hypre_ParCSRMatrixToCSRMatrixAll(hypre_ParCSRMatrix *par_matrix)
         start_index = matrix_i[(int) new_vec_starts[i]];
         num_data = matrix_i[(int) new_vec_starts[i+1]] - start_index; 
         MPI_Irecv(&matrix_data[start_index], num_data, MPI_DOUBLE,
-                        used_procs[i], tag1, comm, &requests[j++]);
+                        used_procs[i], tag1, comm, &requests[j++]);MPI_Request dummy_request_abc9;MPI_Irecv(&matrix_data[start_index], num_data, MPI_DOUBLE,
+                        used_procs[i], tag1, comm, &dummy_request_abc9); MPI_Request_free(&dummy_request_abc9);
         MPI_Irecv(&matrix_j[start_index], num_data, MPI_INT,
                         used_procs[i], tag3, comm, &requests[j++]);
    }
