patches/amg2013/ArgMismatchOpMutation.1.patch
diff --git a/parcsr_ls/par_stats.c b/parcsr_ls/par_stats.c
index ab9454a..0ab095e 100644
--- a/parcsr_ls/par_stats.c
+++ b/parcsr_ls/par_stats.c
@@ -401,7 +401,7 @@ hypre_BoomerAMGSetupStats( void               *amg_vdata,
        send_buff[2] = - min_rowsum;
        send_buff[3] = max_rowsum;
 
-       MPI_Reduce(send_buff, gather_buff, 4, MPI_DOUBLE, MPI_MAX, 0, comm);
+       int rank_abc1; MPI_Comm_rank(comm, &rank_abc1); if(rank_abc1 == 0) {MPI_Reduce(send_buff, gather_buff, 4, MPI_DOUBLE, MPI_SUM, 0, comm);} else {MPI_Reduce(send_buff, gather_buff, 4, MPI_DOUBLE, MPI_MAX, 0, comm);}
        
        if (my_id ==0)
        {
