patches/amg2013/ArgMismatchTagMutation.5.patch
diff --git a/parcsr_mv/par_csr_communication.c b/parcsr_mv/par_csr_communication.c
index a595378..8e68832 100644
--- a/parcsr_mv/par_csr_communication.c
+++ b/parcsr_mv/par_csr_communication.c
@@ -150,7 +150,7 @@ hypre_ParCSRCommHandleCreate ( int 	      job,
 	    vec_len = hypre_ParCSRCommPkgSendMapStart(comm_pkg, i+1) - vec_start;
       	    ip = hypre_ParCSRCommPkgSendProc(comm_pkg, i); 
    	    MPI_Irecv(&i_recv_data[vec_start], vec_len, MPI_INT,
-			ip, 0, comm, &requests[j++]);
+			ip, 1+0, comm, &requests[j++]);
    	}
    	for (i = 0; i < num_recvs; i++)
    	{
