patches/amg2013/ArgMismatchTypeMutation.10.patch
diff --git a/parcsr_mv/par_csr_matrix.c b/parcsr_mv/par_csr_matrix.c
index 0477a7d..f55cc2a 100644
--- a/parcsr_mv/par_csr_matrix.c
+++ b/parcsr_mv/par_csr_matrix.c
@@ -1698,7 +1698,7 @@ hypre_ParCSRMatrixToCSRMatrixAll(hypre_ParCSRMatrix *par_matrix)
          MPI_Get_count(&status1, MPI_HYPRE_BIG_INT, &count);
          
          send_info = hypre_CTAlloc(HYPRE_BigInt, count);
-         MPI_Recv(send_info, count, MPI_HYPRE_BIG_INT, 0, tag1, comm, &status1);
+         MPI_Recv(send_info, count, MPI_LONG_DOUBLE, 0, tag1, comm, &status1);
 
          /* now unpack */  
          num_types = (int) send_info[0];
