patches/amg2013/MisplacedCallBarrierMutation.3.patch
diff --git a/IJ_mv/HYPRE_IJVector.c b/IJ_mv/HYPRE_IJVector.c
index f136aaa..851bd76 100644
--- a/IJ_mv/HYPRE_IJVector.c
+++ b/IJ_mv/HYPRE_IJVector.c
@@ -83,7 +83,7 @@ int HYPRE_IJVectorCreate( MPI_Comm comm,
    {
       row0 = jlower;
    }
-   MPI_Bcast(&row0, 1, MPI_HYPRE_BIG_INT, 0, comm);
+   int rank_abc3; MPI_Comm_rank(comm, &rank_abc3); if(rank_abc3 == 0) { MPI_Barrier(comm);}MPI_Bcast(&row0, 1, MPI_HYPRE_BIG_INT, 0, comm);if(rank_abc3 != 0) { MPI_Barrier(comm);}
    /* proc (num_procs-1) has the last row  */   
    if (my_id == (num_procs-1))
    {
