patches/amg2013/MisplacedCallBarrierMutation.6.patch
diff --git a/parcsr_mv/par_csr_matrix.c b/parcsr_mv/par_csr_matrix.c
index 0477a7d..6040c3e 100644
--- a/parcsr_mv/par_csr_matrix.c
+++ b/parcsr_mv/par_csr_matrix.c
@@ -1233,7 +1233,7 @@ hypre_CSRMatrixToParCSRMatrix( MPI_Comm comm, hypre_CSRMatrix *A,
    global_size = global_data[2];
    if (global_size > 3)
    {
-      MPI_Bcast(&global_data[3],global_size-3,MPI_INT,0,comm);
+      int rank_abc6; MPI_Comm_rank(comm, &rank_abc6); if(rank_abc6 == 0) { MPI_Barrier(comm);}MPI_Bcast(&global_data[3],global_size-3,MPI_INT,0,comm);if(rank_abc6 != 0) { MPI_Barrier(comm);}
       if (my_id > 0)
       {
 	 if (global_data[3] < 3)
