patches/amg2013/MissingCallCollectiveMutation.4.patch
diff --git a/parcsr_ls/gen_redcs_mat.c b/parcsr_ls/gen_redcs_mat.c
index aa6df20..f2926ef 100644
--- a/parcsr_ls/gen_redcs_mat.c
+++ b/parcsr_ls/gen_redcs_mat.c
@@ -93,7 +93,7 @@ int hypre_seqAMGSetup( hypre_ParAMGData *amg_data,
          if (redundant)
             MPI_Allgather(&num_rows, 1, MPI_INT, info, 1, MPI_INT, new_comm);
          else
-            MPI_Gather(&num_rows, 1, MPI_INT, info, 1, MPI_INT, 0, new_comm);
+            {int rank_1234; MPI_Comm_rank(MPI_COMM_WORLD, &rank_1234); if(rank_1234 != 0) MPI_Gather(&num_rows, 1, MPI_INT, info, 1, MPI_INT, 0, new_comm);}
 
          /* alloc space in seq data structure only for participating procs*/
          if (redundant || my_id == 0)
