patches/amg2013/MissingCallCollectiveMutation.5.patch
diff --git a/parcsr_ls/gen_redcs_mat.c b/parcsr_ls/gen_redcs_mat.c
index aa6df20..f49c39d 100644
--- a/parcsr_ls/gen_redcs_mat.c
+++ b/parcsr_ls/gen_redcs_mat.c
@@ -341,7 +341,7 @@ hypre_seqAMGCycle( hypre_ParAMGData *amg_data,
       info = hypre_CTAlloc(int, new_num_procs);
       local_info = nf;
       if (redundant)
-         MPI_Allgather(&local_info, 1, MPI_INT, info, 1, MPI_INT, new_comm);
+         {int rank_1235; MPI_Comm_rank(MPI_COMM_WORLD, &rank_1235); if(rank_1235 != 0) MPI_Allgather(&local_info, 1, MPI_INT, info, 1, MPI_INT, new_comm);}
       else
          MPI_Gather(&local_info, 1, MPI_INT, info, 1, MPI_INT, 0, new_comm);
 
