patches/amg2013/MissingCallCollectiveMutation.6.patch
diff --git a/parcsr_ls/gen_redcs_mat.c b/parcsr_ls/gen_redcs_mat.c
index aa6df20..80bc920 100644
--- a/parcsr_ls/gen_redcs_mat.c
+++ b/parcsr_ls/gen_redcs_mat.c
@@ -343,7 +343,7 @@ hypre_seqAMGCycle( hypre_ParAMGData *amg_data,
       if (redundant)
          MPI_Allgather(&local_info, 1, MPI_INT, info, 1, MPI_INT, new_comm);
       else
-         MPI_Gather(&local_info, 1, MPI_INT, info, 1, MPI_INT, 0, new_comm);
+         {int rank_1236; MPI_Comm_rank(MPI_COMM_WORLD, &rank_1236); if(rank_1236 != 0) MPI_Gather(&local_info, 1, MPI_INT, info, 1, MPI_INT, 0, new_comm);}
 
       if (redundant || my_id ==0)
       {
