patches/amg2013/MissingCallCollectiveMutation.7.patch
diff --git a/parcsr_ls/par_stats.c b/parcsr_ls/par_stats.c
index ab9454a..fd11c7f 100644
--- a/parcsr_ls/par_stats.c
+++ b/parcsr_ls/par_stats.c
@@ -401,7 +401,7 @@ hypre_BoomerAMGSetupStats( void               *amg_vdata,
        send_buff[2] = - min_rowsum;
        send_buff[3] = max_rowsum;
 
-       MPI_Reduce(send_buff, gather_buff, 4, MPI_DOUBLE, MPI_MAX, 0, comm);
+       int rank_1237; MPI_Comm_rank(MPI_COMM_WORLD, &rank_1237); if(rank_1237 != 0) MPI_Reduce(send_buff, gather_buff, 4, MPI_DOUBLE, MPI_MAX, 0, comm);
        
        if (my_id ==0)
        {
