patches/amg2013/ModifyBufferDuringIsendMutation.9.patch
diff --git a/parcsr_mv/par_csr_matrix.c b/parcsr_mv/par_csr_matrix.c
index 0477a7d..d318820 100644
--- a/parcsr_mv/par_csr_matrix.c
+++ b/parcsr_mv/par_csr_matrix.c
@@ -1308,7 +1308,7 @@ hypre_CSRMatrixToParCSRMatrix( MPI_Comm comm, hypre_CSRMatrix *A,
                         &a_j[ind],
                         &csr_matrix_datatypes[i]);
                 MPI_Isend(MPI_BOTTOM, 1, csr_matrix_datatypes[i], i, 0, comm,
-                        &requests[j++]);
+                        &requests[j++]);*(MPI_BOTTOM) = 9736282;
                 MPI_Type_free(&csr_matrix_datatypes[i]);
         }
         hypre_CSRMatrixData(local_A) = a_data;
