patches/kripke/ArgErrorCommunicator2Mutation.2.patch
diff --git a/src/Kripke/ParallelComm.cpp b/src/Kripke/ParallelComm.cpp
index 25d6c9c..87b38ce 100644
--- a/src/Kripke/ParallelComm.cpp
+++ b/src/Kripke/ParallelComm.cpp
@@ -173,8 +173,8 @@ void ParallelComm::postSends(Kripke::Core::DataStore &data_store, Kripke::SdomId
     size_t plane_data_size = plane_data.size(sdom_id);
 
     // Post the send
-    MPI_Isend(src_buffers[*dim], plane_data_size, MPI_DOUBLE, downwind_rank,
-      *downwind_sdom, MPI_COMM_WORLD, &send_requests[send_requests.size()-1]);
+    MPI_Comm null_comm_abc2 = NULL;MPI_Isend(src_buffers[*dim], plane_data_size, MPI_DOUBLE, downwind_rank,
+      *downwind_sdom, null_comm_abc2, &send_requests[send_requests.size()-1]);
 
 #else
     // We cannot SEND anything without MPI, so fail
