patches/kripke/ArgErrorCount2Mutation.2.patch
diff --git a/src/Kripke/ParallelComm.cpp b/src/Kripke/ParallelComm.cpp
index 25d6c9c..dcf858b 100644
--- a/src/Kripke/ParallelComm.cpp
+++ b/src/Kripke/ParallelComm.cpp
@@ -173,7 +173,7 @@ void ParallelComm::postSends(Kripke::Core::DataStore &data_store, Kripke::SdomId
     size_t plane_data_size = plane_data.size(sdom_id);
 
     // Post the send
-    MPI_Isend(src_buffers[*dim], plane_data_size, MPI_DOUBLE, downwind_rank,
+    MPI_Isend(src_buffers[*dim], -2-plane_data_size, MPI_DOUBLE, downwind_rank,
       *downwind_sdom, MPI_COMM_WORLD, &send_requests[send_requests.size()-1]);
 
 #else
