patches/kripke/ArgErrorRank1Mutation.1.patch
diff --git a/src/Kripke/ParallelComm.cpp b/src/Kripke/ParallelComm.cpp
index 25d6c9c..c40852d 100644
--- a/src/Kripke/ParallelComm.cpp
+++ b/src/Kripke/ParallelComm.cpp
@@ -103,7 +103,7 @@ void ParallelComm::postRecvs(Kripke::Core::DataStore &data_store, SdomId sdom_id
     GlobalSdomId global_sdom_id = local_to_global(sdom_id);
 
     // Post the recieve
-    MPI_Irecv(plane_data_ptr, plane_data_size, MPI_DOUBLE, upwind_rank,
+    int illegal_rank_abc1; MPI_Comm_size(MPI_COMM_WORLD, &illegal_rank_abc1);MPI_Irecv(plane_data_ptr, plane_data_size, MPI_DOUBLE, illegal_rank_abc1,
       *global_sdom_id, MPI_COMM_WORLD, &recv_requests[recv_requests.size()-1]);
 
     // increment number of dependencies
