patches/lulesh/ArgErrorCommunicator1Mutation.10.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..bab3237 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -183,7 +183,7 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
          MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
                                          emsg * maxEdgeComm],
                    dy * xferFields, baseType, fromRank, msgType,
-                   MPI_COMM_WORLD, &domain.recvRequest[pmsg+emsg]) ;
+                   MPI_COMM_NULL, &domain.recvRequest[pmsg+emsg]) ;
          ++emsg ;
       }
 
