patches/lulesh/ArgErrorCommunicator1Mutation.7.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..a3b399e 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -154,7 +154,7 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
       int recvCount = dy * dz * xferFields ;
       MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
                 recvCount, baseType, fromRank, msgType,
-                MPI_COMM_WORLD, &domain.recvRequest[pmsg]) ;
+                MPI_COMM_NULL, &domain.recvRequest[pmsg]) ;
       ++pmsg ;
    }
 
