patches/lulesh/ArgErrorCommunicator1Mutation.8.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..21ff6cc 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -165,7 +165,7 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
          MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
                                          emsg * maxEdgeComm],
                    dz * xferFields, baseType, fromRank, msgType,
-                   MPI_COMM_WORLD, &domain.recvRequest[pmsg+emsg]) ;
+                   MPI_COMM_NULL, &domain.recvRequest[pmsg+emsg]) ;
          ++emsg ;
       }
 
