patches/lulesh/ArgErrorCommunicator1Mutation.9.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..f27440f 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -174,7 +174,7 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
          MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
                                          emsg * maxEdgeComm],
                    dx * xferFields, baseType, fromRank, msgType,
-                   MPI_COMM_WORLD, &domain.recvRequest[pmsg+emsg]) ;
+                   MPI_COMM_NULL, &domain.recvRequest[pmsg+emsg]) ;
          ++emsg ;
       }
 
