patches/lulesh/ArgErrorCommunicator2Mutation.10.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..2984cd9 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -180,10 +180,10 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
 
       if (colMin && planeMin && doRecv) {
          int fromRank = myRank - domain.tp()*domain.tp() - 1 ;
-         MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
+         MPI_Comm null_comm_abc10 = NULL;MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
                                          emsg * maxEdgeComm],
                    dy * xferFields, baseType, fromRank, msgType,
-                   MPI_COMM_WORLD, &domain.recvRequest[pmsg+emsg]) ;
+                   null_comm_abc10, &domain.recvRequest[pmsg+emsg]) ;
          ++emsg ;
       }
 
