patches/lulesh/ArgErrorCommunicator2Mutation.5.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..b794e6f 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -134,9 +134,9 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
       /* semi-contiguous memory */
       int fromRank = myRank + domain.tp() ;
       int recvCount = dx * dz * xferFields ;
-      MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
+      MPI_Comm null_comm_abc5 = NULL;MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
                 recvCount, baseType, fromRank, msgType,
-                MPI_COMM_WORLD, &domain.recvRequest[pmsg]) ;
+                null_comm_abc5, &domain.recvRequest[pmsg]) ;
       ++pmsg ;
    }
    if (colMin && doRecv) {
