patches/lulesh/ArgErrorCommunicator2Mutation.6.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..24626bb 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -143,9 +143,9 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
       /* scattered memory */
       int fromRank = myRank - 1 ;
       int recvCount = dy * dz * xferFields ;
-      MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
+      MPI_Comm null_comm_abc6 = NULL;MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
                 recvCount, baseType, fromRank, msgType,
-                MPI_COMM_WORLD, &domain.recvRequest[pmsg]) ;
+                null_comm_abc6, &domain.recvRequest[pmsg]) ;
       ++pmsg ;
    }
    if (colMax) {
