patches/lulesh/ArgErrorCommunicator2Mutation.7.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..f3bf44a 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -152,9 +152,9 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
       /* scattered memory */
       int fromRank = myRank + 1 ;
       int recvCount = dy * dz * xferFields ;
-      MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
+      MPI_Comm null_comm_abc7 = NULL;MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
                 recvCount, baseType, fromRank, msgType,
-                MPI_COMM_WORLD, &domain.recvRequest[pmsg]) ;
+                null_comm_abc7, &domain.recvRequest[pmsg]) ;
       ++pmsg ;
    }
 
