patches/lulesh/ArgErrorCommunicator2Mutation.9.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..3cf25fa 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -171,10 +171,10 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
 
       if (rowMin && planeMin && doRecv) {
          int fromRank = myRank - domain.tp()*domain.tp() - domain.tp() ;
-         MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
+         MPI_Comm null_comm_abc9 = NULL;MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
                                          emsg * maxEdgeComm],
                    dx * xferFields, baseType, fromRank, msgType,
-                   MPI_COMM_WORLD, &domain.recvRequest[pmsg+emsg]) ;
+                   null_comm_abc9, &domain.recvRequest[pmsg+emsg]) ;
          ++emsg ;
       }
 
