patches/lulesh/ArgErrorCount1Mutation.5.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..a2058a8 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -135,7 +135,7 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
       int fromRank = myRank + domain.tp() ;
       int recvCount = dx * dz * xferFields ;
       MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
-                recvCount, baseType, fromRank, msgType,
+                2 * recvCount, baseType, fromRank, msgType,
                 MPI_COMM_WORLD, &domain.recvRequest[pmsg]) ;
       ++pmsg ;
    }
