patches/lulesh/ArgErrorCount1Mutation.9.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..53c2146 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -173,7 +173,7 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
          int fromRank = myRank - domain.tp()*domain.tp() - domain.tp() ;
          MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
                                          emsg * maxEdgeComm],
-                   dx * xferFields, baseType, fromRank, msgType,
+                   2 * dx * xferFields, baseType, fromRank, msgType,
                    MPI_COMM_WORLD, &domain.recvRequest[pmsg+emsg]) ;
          ++emsg ;
       }
