patches/lulesh/ArgErrorNullBufferMutation.10.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..f95c78d 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -171,8 +171,7 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
 
       if (rowMin && planeMin && doRecv) {
          int fromRank = myRank - domain.tp()*domain.tp() - domain.tp() ;
-         MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
-                                         emsg * maxEdgeComm],
+         MPI_Irecv(NULL,
                    dx * xferFields, baseType, fromRank, msgType,
                    MPI_COMM_WORLD, &domain.recvRequest[pmsg+emsg]) ;
          ++emsg ;
