patches/lulesh/ArgErrorNullBufferMutation.3.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..d4a33fc 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -107,7 +107,7 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
       /* contiguous memory */
       int fromRank = myRank - domain.tp()*domain.tp() ;
       int recvCount = dx * dy * xferFields ;
-      MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
+      MPI_Irecv(NULL,
                 recvCount, baseType, fromRank, msgType,
                 MPI_COMM_WORLD, &domain.recvRequest[pmsg]) ;
       ++pmsg ;
