patches/lulesh/ArgErrorNullBufferMutation.8.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..95d3cb0 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -152,7 +152,7 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
       /* scattered memory */
       int fromRank = myRank + 1 ;
       int recvCount = dy * dz * xferFields ;
-      MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
+      MPI_Irecv(NULL,
                 recvCount, baseType, fromRank, msgType,
                 MPI_COMM_WORLD, &domain.recvRequest[pmsg]) ;
       ++pmsg ;
