patches/lulesh/ArgErrorNullBufferMutation.9.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..91835dc 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -162,8 +162,7 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
       /* receive data from domains connected only by an edge */
       if (rowMin && colMin && doRecv) {
          int fromRank = myRank - domain.tp() - 1 ;
-         MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
-                                         emsg * maxEdgeComm],
+         MPI_Irecv(NULL,
                    dz * xferFields, baseType, fromRank, msgType,
                    MPI_COMM_WORLD, &domain.recvRequest[pmsg+emsg]) ;
          ++emsg ;
