patches/lulesh/ArgErrorOp1Mutation.1.patch
diff --git a/lulesh.cc b/lulesh.cc
index a141611..7a44cd8 100644
--- a/lulesh.cc
+++ b/lulesh.cc
@@ -2790,8 +2790,8 @@ int main(int argc, char *argv[])
 #endif
    double elapsed_timeG;
 #if USE_MPI   
-   MPI_Reduce(&elapsed_time, &elapsed_timeG, 1, MPI_DOUBLE,
-              MPI_MAX, 0, MPI_COMM_WORLD);
+   MPI_Op null_op_1231 = NULL;MPI_Reduce(&elapsed_time, &elapsed_timeG, 1, MPI_DOUBLE,
+              null_op_1231, 0, MPI_COMM_WORLD);
 #else
    elapsed_timeG = elapsed_time;
 #endif
