patches/lulesh/ArgErrorRank1Mutation.10.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..3843d0f 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -189,9 +189,9 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
 
       if (rowMax && colMax) {
          int fromRank = myRank + domain.tp() + 1 ;
-         MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
+         int illegal_rank_abc10; MPI_Comm_size(MPI_COMM_WORLD, &illegal_rank_abc10);MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
                                          emsg * maxEdgeComm],
-                   dz * xferFields, baseType, fromRank, msgType,
+                   dz * xferFields, baseType, illegal_rank_abc10, msgType,
                    MPI_COMM_WORLD, &domain.recvRequest[pmsg+emsg]) ;
          ++emsg ;
       }
