patches/lulesh/ArgErrorRank1Mutation.2.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..7ac9dda 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -116,8 +116,8 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
       /* contiguous memory */
       int fromRank = myRank + domain.tp()*domain.tp() ;
       int recvCount = dx * dy * xferFields ;
-      MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
-                recvCount, baseType, fromRank, msgType,
+      int illegal_rank_abc2; MPI_Comm_size(MPI_COMM_WORLD, &illegal_rank_abc2);MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
+                recvCount, baseType, illegal_rank_abc2, msgType,
                 MPI_COMM_WORLD, &domain.recvRequest[pmsg]) ;
       ++pmsg ;
    }
