patches/lulesh/ArgErrorRank1Mutation.4.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..5eeea7f 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -134,8 +134,8 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
       /* semi-contiguous memory */
       int fromRank = myRank + domain.tp() ;
       int recvCount = dx * dz * xferFields ;
-      MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
-                recvCount, baseType, fromRank, msgType,
+      int illegal_rank_abc4; MPI_Comm_size(MPI_COMM_WORLD, &illegal_rank_abc4);MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
+                recvCount, baseType, illegal_rank_abc4, msgType,
                 MPI_COMM_WORLD, &domain.recvRequest[pmsg]) ;
       ++pmsg ;
    }
