patches/lulesh/ArgErrorRank1Mutation.6.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..fc42633 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -152,8 +152,8 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
       /* scattered memory */
       int fromRank = myRank + 1 ;
       int recvCount = dy * dz * xferFields ;
-      MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
-                recvCount, baseType, fromRank, msgType,
+      int illegal_rank_abc6; MPI_Comm_size(MPI_COMM_WORLD, &illegal_rank_abc6);MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
+                recvCount, baseType, illegal_rank_abc6, msgType,
                 MPI_COMM_WORLD, &domain.recvRequest[pmsg]) ;
       ++pmsg ;
    }
