patches/lulesh/ArgErrorRank1Mutation.7.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..f7954ff 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -162,9 +162,9 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
       /* receive data from domains connected only by an edge */
       if (rowMin && colMin && doRecv) {
          int fromRank = myRank - domain.tp() - 1 ;
-         MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
+         int illegal_rank_abc7; MPI_Comm_size(MPI_COMM_WORLD, &illegal_rank_abc7);MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
                                          emsg * maxEdgeComm],
-                   dz * xferFields, baseType, fromRank, msgType,
+                   dz * xferFields, baseType, illegal_rank_abc7, msgType,
                    MPI_COMM_WORLD, &domain.recvRequest[pmsg+emsg]) ;
          ++emsg ;
       }
