patches/lulesh/ArgErrorRank1Mutation.8.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..89e862e 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -171,9 +171,9 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
 
       if (rowMin && planeMin && doRecv) {
          int fromRank = myRank - domain.tp()*domain.tp() - domain.tp() ;
-         MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
+         int illegal_rank_abc8; MPI_Comm_size(MPI_COMM_WORLD, &illegal_rank_abc8);MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
                                          emsg * maxEdgeComm],
-                   dx * xferFields, baseType, fromRank, msgType,
+                   dx * xferFields, baseType, illegal_rank_abc8, msgType,
                    MPI_COMM_WORLD, &domain.recvRequest[pmsg+emsg]) ;
          ++emsg ;
       }
