patches/lulesh/ArgErrorRank1Mutation.9.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..f296ba4 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -180,9 +180,9 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
 
       if (colMin && planeMin && doRecv) {
          int fromRank = myRank - domain.tp()*domain.tp() - 1 ;
-         MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
+         int illegal_rank_abc9; MPI_Comm_size(MPI_COMM_WORLD, &illegal_rank_abc9);MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
                                          emsg * maxEdgeComm],
-                   dy * xferFields, baseType, fromRank, msgType,
+                   dy * xferFields, baseType, illegal_rank_abc9, msgType,
                    MPI_COMM_WORLD, &domain.recvRequest[pmsg+emsg]) ;
          ++emsg ;
       }
