patches/lulesh/ArgErrorRoot1Mutation.1.patch
diff --git a/lulesh.cc b/lulesh.cc
index a141611..30788f5 100644
--- a/lulesh.cc
+++ b/lulesh.cc
@@ -2790,8 +2790,8 @@ int main(int argc, char *argv[])
 #endif
    double elapsed_timeG;
 #if USE_MPI   
-   MPI_Reduce(&elapsed_time, &elapsed_timeG, 1, MPI_DOUBLE,
-              MPI_MAX, 0, MPI_COMM_WORLD);
+   int negative_dest_1231 = -1;MPI_Reduce(&elapsed_time, &elapsed_timeG, 1, MPI_DOUBLE,
+              MPI_MAX, negative_dest_1231, MPI_COMM_WORLD);
 #else
    elapsed_timeG = elapsed_time;
 #endif
