patches/lulesh/ArgErrorTag1Mutation.10.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..088b7db 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -191,7 +191,7 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
          int fromRank = myRank + domain.tp() + 1 ;
          MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
                                          emsg * maxEdgeComm],
-                   dz * xferFields, baseType, fromRank, msgType,
+                   dz * xferFields, baseType, fromRank, -2-msgType,
                    MPI_COMM_WORLD, &domain.recvRequest[pmsg+emsg]) ;
          ++emsg ;
       }
