patches/lulesh/ArgErrorTag1Mutation.3.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..6e6b4f3 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -126,7 +126,7 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
       int fromRank = myRank - domain.tp() ;
       int recvCount = dx * dz * xferFields ;
       MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
-                recvCount, baseType, fromRank, msgType,
+                recvCount, baseType, fromRank, -2-msgType,
                 MPI_COMM_WORLD, &domain.recvRequest[pmsg]) ;
       ++pmsg ;
    }
