patches/lulesh/ArgErrorTag2Mutation.1.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..922bacd 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -107,8 +107,8 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
       /* contiguous memory */
       int fromRank = myRank - domain.tp()*domain.tp() ;
       int recvCount = dx * dy * xferFields ;
-      MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
-                recvCount, baseType, fromRank, msgType,
+      long long illegal_tag_abc1 = MPI_TAG_UB + 1;MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
+                recvCount, baseType, fromRank, illegal_tag_abc1,
                 MPI_COMM_WORLD, &domain.recvRequest[pmsg]) ;
       ++pmsg ;
    }
