patches/lulesh/ArgErrorTag2Mutation.10.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..04573c0 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -189,9 +189,9 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
 
       if (rowMax && colMax) {
          int fromRank = myRank + domain.tp() + 1 ;
-         MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
+         long long illegal_tag_abc10 = MPI_TAG_UB + 1;MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
                                          emsg * maxEdgeComm],
-                   dz * xferFields, baseType, fromRank, msgType,
+                   dz * xferFields, baseType, fromRank, illegal_tag_abc10,
                    MPI_COMM_WORLD, &domain.recvRequest[pmsg+emsg]) ;
          ++emsg ;
       }
