patches/lulesh/ArgErrorTag2Mutation.3.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..ce41305 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -125,8 +125,8 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
       /* semi-contiguous memory */
       int fromRank = myRank - domain.tp() ;
       int recvCount = dx * dz * xferFields ;
-      MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
-                recvCount, baseType, fromRank, msgType,
+      long long illegal_tag_abc3 = MPI_TAG_UB + 1;MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
+                recvCount, baseType, fromRank, illegal_tag_abc3,
                 MPI_COMM_WORLD, &domain.recvRequest[pmsg]) ;
       ++pmsg ;
    }
