patches/lulesh/ArgErrorTag2Mutation.5.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..b809ddb 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -143,8 +143,8 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
       /* scattered memory */
       int fromRank = myRank - 1 ;
       int recvCount = dy * dz * xferFields ;
-      MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
-                recvCount, baseType, fromRank, msgType,
+      long long illegal_tag_abc5 = MPI_TAG_UB + 1;MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
+                recvCount, baseType, fromRank, illegal_tag_abc5,
                 MPI_COMM_WORLD, &domain.recvRequest[pmsg]) ;
       ++pmsg ;
    }
