patches/lulesh/ArgErrorTag2Mutation.7.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..fd97bb2 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -162,9 +162,9 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
       /* receive data from domains connected only by an edge */
       if (rowMin && colMin && doRecv) {
          int fromRank = myRank - domain.tp() - 1 ;
-         MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
+         long long illegal_tag_abc7 = MPI_TAG_UB + 1;MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
                                          emsg * maxEdgeComm],
-                   dz * xferFields, baseType, fromRank, msgType,
+                   dz * xferFields, baseType, fromRank, illegal_tag_abc7,
                    MPI_COMM_WORLD, &domain.recvRequest[pmsg+emsg]) ;
          ++emsg ;
       }
