patches/lulesh/ArgErrorTag2Mutation.8.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..4a080a2 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -171,9 +171,9 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
 
       if (rowMin && planeMin && doRecv) {
          int fromRank = myRank - domain.tp()*domain.tp() - domain.tp() ;
-         MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
+         long long illegal_tag_abc8 = MPI_TAG_UB + 1;MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
                                          emsg * maxEdgeComm],
-                   dx * xferFields, baseType, fromRank, msgType,
+                   dx * xferFields, baseType, fromRank, illegal_tag_abc8,
                    MPI_COMM_WORLD, &domain.recvRequest[pmsg+emsg]) ;
          ++emsg ;
       }
