patches/lulesh/ArgErrorTag2Mutation.9.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..92af42a 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -180,9 +180,9 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
 
       if (colMin && planeMin && doRecv) {
          int fromRank = myRank - domain.tp()*domain.tp() - 1 ;
-         MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
+         long long illegal_tag_abc9 = MPI_TAG_UB + 1;MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
                                          emsg * maxEdgeComm],
-                   dy * xferFields, baseType, fromRank, msgType,
+                   dy * xferFields, baseType, fromRank, illegal_tag_abc9,
                    MPI_COMM_WORLD, &domain.recvRequest[pmsg+emsg]) ;
          ++emsg ;
       }
