patches/lulesh/ArgErrorType1Mutation.10.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..034375f 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -182,7 +182,7 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
          int fromRank = myRank - domain.tp()*domain.tp() - 1 ;
          MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
                                          emsg * maxEdgeComm],
-                   dy * xferFields, baseType, fromRank, msgType,
+                   dy * xferFields, MPI_LONG_DOUBLE, fromRank, msgType,
                    MPI_COMM_WORLD, &domain.recvRequest[pmsg+emsg]) ;
          ++emsg ;
       }
