patches/lulesh/ArgErrorType2Mutation.1.patch
diff --git a/lulesh.cc b/lulesh.cc
index a141611..8235c5a 100644
--- a/lulesh.cc
+++ b/lulesh.cc
@@ -2790,7 +2790,7 @@ int main(int argc, char *argv[])
 #endif
    double elapsed_timeG;
 #if USE_MPI   
-   MPI_Reduce(&elapsed_time, &elapsed_timeG, 1, MPI_DOUBLE,
+   MPI_Reduce(&elapsed_time, &elapsed_timeG, 1, NULL,
               MPI_MAX, 0, MPI_COMM_WORLD);
 #else
    elapsed_timeG = elapsed_time;
