patches/lulesh/ArgErrorType2Mutation.2.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..73d6141 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -108,7 +108,7 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
       int fromRank = myRank - domain.tp()*domain.tp() ;
       int recvCount = dx * dy * xferFields ;
       MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
-                recvCount, baseType, fromRank, msgType,
+                recvCount, NULL, fromRank, msgType,
                 MPI_COMM_WORLD, &domain.recvRequest[pmsg]) ;
       ++pmsg ;
    }
