patches/lulesh/ArgErrorType2Mutation.8.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..8262c88 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -164,7 +164,7 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
          int fromRank = myRank - domain.tp() - 1 ;
          MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
                                          emsg * maxEdgeComm],
-                   dz * xferFields, baseType, fromRank, msgType,
+                   dz * xferFields, NULL, fromRank, msgType,
                    MPI_COMM_WORLD, &domain.recvRequest[pmsg+emsg]) ;
          ++emsg ;
       }
