patches/lulesh/ArgMismatchCommunicatorMutation.1.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..d982dd9 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -417,9 +417,9 @@ void CommSend(Domain& domain, int msgType,
          }
          destAddr -= xferFields*sendCount ;
 
-         MPI_Isend(destAddr, xferFields*sendCount, baseType,
+         int rank_abc1;MPI_Comm_rank(MPI_COMM_WORLD, &rank_abc1);int color_abc1 = rank_abc1 / 1;MPI_Comm new_wrong_communicator_abc1;MPI_Comm_split(MPI_COMM_WORLD, color_abc1, rank_abc1, &new_wrong_communicator_abc1);MPI_Isend(destAddr, xferFields*sendCount, baseType,
                    myRank - domain.tp()*domain.tp(), msgType,
-                   MPI_COMM_WORLD, &domain.sendRequest[pmsg]) ;
+                   new_wrong_communicator_abc1, &domain.sendRequest[pmsg]) ;
          ++pmsg ;
       }
       if (planeMax && doSend) {
