patches/lulesh/ArgMismatchCommunicatorMutation.4.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..fd99ad9 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -474,9 +474,9 @@ void CommSend(Domain& domain, int msgType,
          }
          destAddr -= xferFields*sendCount ;
 
-         MPI_Isend(destAddr, xferFields*sendCount, baseType,
+         int rank_abc4;MPI_Comm_rank(MPI_COMM_WORLD, &rank_abc4);int color_abc4 = rank_abc4 / 1;MPI_Comm new_wrong_communicator_abc4;MPI_Comm_split(MPI_COMM_WORLD, color_abc4, rank_abc4, &new_wrong_communicator_abc4);MPI_Isend(destAddr, xferFields*sendCount, baseType,
                    myRank + domain.tp(), msgType,
-                   MPI_COMM_WORLD, &domain.sendRequest[pmsg]) ;
+                   new_wrong_communicator_abc4, &domain.sendRequest[pmsg]) ;
          ++pmsg ;
       }
    }
