patches/lulesh/ArgMismatchCommunicatorMutation.6.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..ecbb53b 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -515,9 +515,9 @@ void CommSend(Domain& domain, int msgType,
          }
          destAddr -= xferFields*sendCount ;
 
-         MPI_Isend(destAddr, xferFields*sendCount, baseType,
+         int rank_abc6;MPI_Comm_rank(MPI_COMM_WORLD, &rank_abc6);int color_abc6 = rank_abc6 / 1;MPI_Comm new_wrong_communicator_abc6;MPI_Comm_split(MPI_COMM_WORLD, color_abc6, rank_abc6, &new_wrong_communicator_abc6);MPI_Isend(destAddr, xferFields*sendCount, baseType,
                    myRank + 1, msgType,
-                   MPI_COMM_WORLD, &domain.sendRequest[pmsg]) ;
+                   new_wrong_communicator_abc6, &domain.sendRequest[pmsg]) ;
          ++pmsg ;
       }
    }
