patches/lulesh/ArgMismatchCommunicatorMutation.7.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..076f03f 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -535,8 +535,8 @@ void CommSend(Domain& domain, int msgType,
             destAddr += dz ;
          }
          destAddr -= xferFields*dz ;
-         MPI_Isend(destAddr, xferFields*dz, baseType, toRank, msgType,
-                   MPI_COMM_WORLD, &domain.sendRequest[pmsg+emsg]) ;
+         int rank_abc7;MPI_Comm_rank(MPI_COMM_WORLD, &rank_abc7);int color_abc7 = rank_abc7 / 1;MPI_Comm new_wrong_communicator_abc7;MPI_Comm_split(MPI_COMM_WORLD, color_abc7, rank_abc7, &new_wrong_communicator_abc7);MPI_Isend(destAddr, xferFields*dz, baseType, toRank, msgType,
+                   new_wrong_communicator_abc7, &domain.sendRequest[pmsg+emsg]) ;
          ++emsg ;
       }
 
