patches/lulesh/ArgMismatchCommunicatorMutation.9.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..012d2f7 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -569,8 +569,8 @@ void CommSend(Domain& domain, int msgType,
             destAddr += dy ;
          }
          destAddr -= xferFields*dy ;
-         MPI_Isend(destAddr, xferFields*dy, baseType, toRank, msgType,
-                   MPI_COMM_WORLD, &domain.sendRequest[pmsg+emsg]) ;
+         int rank_abc9;MPI_Comm_rank(MPI_COMM_WORLD, &rank_abc9);int color_abc9 = rank_abc9 / 1;MPI_Comm new_wrong_communicator_abc9;MPI_Comm_split(MPI_COMM_WORLD, color_abc9, rank_abc9, &new_wrong_communicator_abc9);MPI_Isend(destAddr, xferFields*dy, baseType, toRank, msgType,
+                   new_wrong_communicator_abc9, &domain.sendRequest[pmsg+emsg]) ;
          ++emsg ;
       }
 
