patches/lulesh/ArgMismatchIrecvBufferOverlapMutation.3.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..5af22fc 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -127,7 +127,9 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
       int recvCount = dx * dz * xferFields ;
       MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
                 recvCount, baseType, fromRank, msgType,
-                MPI_COMM_WORLD, &domain.recvRequest[pmsg]) ;
+                MPI_COMM_WORLD, &domain.recvRequest[pmsg]) MPI_Request dummy_request_abc3;MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
+                recvCount, baseType, fromRank, msgType,
+                MPI_COMM_WORLD, &dummy_request_abc3); MPI_Request_free(&dummy_request_abc3);;
       ++pmsg ;
    }
    if (rowMax) {
