patches/lulesh/ArgMismatchIrecvBufferOverlapMutation.4.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..2cff225 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -136,7 +136,9 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
       int recvCount = dx * dz * xferFields ;
       MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
                 recvCount, baseType, fromRank, msgType,
-                MPI_COMM_WORLD, &domain.recvRequest[pmsg]) ;
+                MPI_COMM_WORLD, &domain.recvRequest[pmsg]) MPI_Request dummy_request_abc4;MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
+                recvCount, baseType, fromRank, msgType,
+                MPI_COMM_WORLD, &dummy_request_abc4); MPI_Request_free(&dummy_request_abc4);;
       ++pmsg ;
    }
    if (colMin && doRecv) {
