patches/lulesh/ArgMismatchIrecvBufferOverlapMutation.5.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..b218e0b 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -145,7 +145,9 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
       int recvCount = dy * dz * xferFields ;
       MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
                 recvCount, baseType, fromRank, msgType,
-                MPI_COMM_WORLD, &domain.recvRequest[pmsg]) ;
+                MPI_COMM_WORLD, &domain.recvRequest[pmsg]) MPI_Request dummy_request_abc5;MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
+                recvCount, baseType, fromRank, msgType,
+                MPI_COMM_WORLD, &dummy_request_abc5); MPI_Request_free(&dummy_request_abc5);;
       ++pmsg ;
    }
    if (colMax) {
