patches/lulesh/ArgMismatchIrecvBufferOverlapMutation.6.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..4c81daa 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -154,7 +154,9 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
       int recvCount = dy * dz * xferFields ;
       MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
                 recvCount, baseType, fromRank, msgType,
-                MPI_COMM_WORLD, &domain.recvRequest[pmsg]) ;
+                MPI_COMM_WORLD, &domain.recvRequest[pmsg]) MPI_Request dummy_request_abc6;MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
+                recvCount, baseType, fromRank, msgType,
+                MPI_COMM_WORLD, &dummy_request_abc6); MPI_Request_free(&dummy_request_abc6);;
       ++pmsg ;
    }
 
