patches/lulesh/ArgMismatchIrecvBufferOverlapMutation.7.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..e89cbf3 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -165,7 +165,10 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
          MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
                                          emsg * maxEdgeComm],
                    dz * xferFields, baseType, fromRank, msgType,
-                   MPI_COMM_WORLD, &domain.recvRequest[pmsg+emsg]) ;
+                   MPI_COMM_WORLD, &domain.recvRequest[pmsg+emsg]) MPI_Request dummy_request_abc7;MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
+                                         emsg * maxEdgeComm],
+                   dz * xferFields, baseType, fromRank, msgType,
+                   MPI_COMM_WORLD, &dummy_request_abc7); MPI_Request_free(&dummy_request_abc7);;
          ++emsg ;
       }
 
