patches/lulesh/ArgMismatchIrecvBufferOverlapMutation.8.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..d86997b 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -174,7 +174,10 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
          MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
                                          emsg * maxEdgeComm],
                    dx * xferFields, baseType, fromRank, msgType,
-                   MPI_COMM_WORLD, &domain.recvRequest[pmsg+emsg]) ;
+                   MPI_COMM_WORLD, &domain.recvRequest[pmsg+emsg]) MPI_Request dummy_request_abc8;MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
+                                         emsg * maxEdgeComm],
+                   dx * xferFields, baseType, fromRank, msgType,
+                   MPI_COMM_WORLD, &dummy_request_abc8); MPI_Request_free(&dummy_request_abc8);;
          ++emsg ;
       }
 
