patches/lulesh/ArgMismatchIrecvBufferOverlapMutation.9.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..bbc6449 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -183,7 +183,10 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
          MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
                                          emsg * maxEdgeComm],
                    dy * xferFields, baseType, fromRank, msgType,
-                   MPI_COMM_WORLD, &domain.recvRequest[pmsg+emsg]) ;
+                   MPI_COMM_WORLD, &domain.recvRequest[pmsg+emsg]) MPI_Request dummy_request_abc9;MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm +
+                                         emsg * maxEdgeComm],
+                   dy * xferFields, baseType, fromRank, msgType,
+                   MPI_COMM_WORLD, &dummy_request_abc9); MPI_Request_free(&dummy_request_abc9);;
          ++emsg ;
       }
 
