patches/lulesh/ArgMismatchTagMutation.2.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..e999eca 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -117,7 +117,7 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
       int fromRank = myRank + domain.tp()*domain.tp() ;
       int recvCount = dx * dy * xferFields ;
       MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
-                recvCount, baseType, fromRank, msgType,
+                recvCount, baseType, fromRank, 1+msgType,
                 MPI_COMM_WORLD, &domain.recvRequest[pmsg]) ;
       ++pmsg ;
    }
