patches/lulesh/ArgMismatchTypeMutation.6.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..8f4666e 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -153,7 +153,7 @@ void CommRecv(Domain& domain, int msgType, Index_t xferFields,
       int fromRank = myRank + 1 ;
       int recvCount = dy * dz * xferFields ;
       MPI_Irecv(&domain.commDataRecv[pmsg * maxPlaneComm],
-                recvCount, baseType, fromRank, msgType,
+                recvCount, MPI_LONG_DOUBLE, fromRank, msgType,
                 MPI_COMM_WORLD, &domain.recvRequest[pmsg]) ;
       ++pmsg ;
    }
