patches/lulesh/MissingCallCollectiveMutation.1.patch
diff --git a/lulesh.cc b/lulesh.cc
index a141611..a1529a3 100644
--- a/lulesh.cc
+++ b/lulesh.cc
@@ -2790,7 +2790,7 @@ int main(int argc, char *argv[])
 #endif
    double elapsed_timeG;
 #if USE_MPI   
-   MPI_Reduce(&elapsed_time, &elapsed_timeG, 1, MPI_DOUBLE,
+   int rank_1231; MPI_Comm_rank(MPI_COMM_WORLD, &rank_1231); if(rank_1231 != 0) MPI_Reduce(&elapsed_time, &elapsed_timeG, 1, MPI_DOUBLE,
               MPI_MAX, 0, MPI_COMM_WORLD);
 #else
    elapsed_timeG = elapsed_time;
