patches/lulesh/MissingCallMpiWaitMutation.10.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..bd9ee8e 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -1036,7 +1036,7 @@ void CommSBN(Domain& domain, int xferFields, Domain_member *fieldData) {
    if (rowMax & colMax) {
       srcAddr = &domain.commDataRecv[pmsg * maxPlaneComm +
                                        emsg * maxEdgeComm] ;
-      MPI_Wait(&domain.recvRequest[pmsg+emsg], &status) ;
+      
       for (Index_t fi=0 ; fi<xferFields; ++fi) {
          Domain_member dest = fieldData[fi] ;
          for (Index_t i=0; i<dz; ++i) {
