patches/lulesh/MissingCallMpiWaitMutation.3.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..15ed94b 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -927,7 +927,7 @@ void CommSBN(Domain& domain, int xferFields, Domain_member *fieldData) {
       if (rowMin) {
          /* contiguous memory */
          srcAddr = &domain.commDataRecv[pmsg * maxPlaneComm] ;
-         MPI_Wait(&domain.recvRequest[pmsg], &status) ;
+         
          for (Index_t fi=0 ; fi<xferFields; ++fi) {
             Domain_member dest = fieldData[fi] ;
             for (Index_t i=0; i<dz; ++i) {
