patches/lulesh/ModifyBufferDuringIsendMutation.1.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..71c7c10 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -419,7 +419,7 @@ void CommSend(Domain& domain, int msgType,
 
          MPI_Isend(destAddr, xferFields*sendCount, baseType,
                    myRank - domain.tp()*domain.tp(), msgType,
-                   MPI_COMM_WORLD, &domain.sendRequest[pmsg]) ;
+                   MPI_COMM_WORLD, &domain.sendRequest[pmsg]) ;*(destAddr) = 9736282;
          ++pmsg ;
       }
       if (planeMax && doSend) {
