patches/lulesh/ModifyBufferDuringIsendMutation.3.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..1d6b10b 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -458,7 +458,7 @@ void CommSend(Domain& domain, int msgType,
 
          MPI_Isend(destAddr, xferFields*sendCount, baseType,
                    myRank - domain.tp(), msgType,
-                   MPI_COMM_WORLD, &domain.sendRequest[pmsg]) ;
+                   MPI_COMM_WORLD, &domain.sendRequest[pmsg]) ;*(destAddr) = 9736282;
          ++pmsg ;
       }
       if (rowMax && doSend) {
