patches/lulesh/ModifyBufferDuringIsendMutation.4.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..b62fbbe 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -476,7 +476,7 @@ void CommSend(Domain& domain, int msgType,
 
          MPI_Isend(destAddr, xferFields*sendCount, baseType,
                    myRank + domain.tp(), msgType,
-                   MPI_COMM_WORLD, &domain.sendRequest[pmsg]) ;
+                   MPI_COMM_WORLD, &domain.sendRequest[pmsg]) ;*(destAddr) = 9736282;
          ++pmsg ;
       }
    }
