patches/lulesh/ModifyBufferDuringIsendMutation.5.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..039569a 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -499,7 +499,7 @@ void CommSend(Domain& domain, int msgType,
 
          MPI_Isend(destAddr, xferFields*sendCount, baseType,
                    myRank - 1, msgType,
-                   MPI_COMM_WORLD, &domain.sendRequest[pmsg]) ;
+                   MPI_COMM_WORLD, &domain.sendRequest[pmsg]) ;*(destAddr) = 9736282;
          ++pmsg ;
       }
       if (colMax && doSend) {
