patches/lulesh/ModifyBufferDuringIsendMutation.7.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..365e634 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -536,7 +536,7 @@ void CommSend(Domain& domain, int msgType,
          }
          destAddr -= xferFields*dz ;
          MPI_Isend(destAddr, xferFields*dz, baseType, toRank, msgType,
-                   MPI_COMM_WORLD, &domain.sendRequest[pmsg+emsg]) ;
+                   MPI_COMM_WORLD, &domain.sendRequest[pmsg+emsg]) ;*(destAddr) = 9736282;
          ++emsg ;
       }
 
