patches/lulesh/ModifyBufferDuringIsendMutation.8.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..2acd4b8 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -553,7 +553,7 @@ void CommSend(Domain& domain, int msgType,
          }
          destAddr -= xferFields*dx ;
          MPI_Isend(destAddr, xferFields*dx, baseType, toRank, msgType,
-                   MPI_COMM_WORLD, &domain.sendRequest[pmsg+emsg]) ;
+                   MPI_COMM_WORLD, &domain.sendRequest[pmsg+emsg]) ;*(destAddr) = 9736282;
          ++emsg ;
       }
 
