patches/lulesh/ModifyBufferDuringIsendMutation.9.patch
diff --git a/lulesh-comm.cc b/lulesh-comm.cc
index a30c3ec..c237eac 100644
--- a/lulesh-comm.cc
+++ b/lulesh-comm.cc
@@ -570,7 +570,7 @@ void CommSend(Domain& domain, int msgType,
          }
          destAddr -= xferFields*dy ;
          MPI_Isend(destAddr, xferFields*dy, baseType, toRank, msgType,
-                   MPI_COMM_WORLD, &domain.sendRequest[pmsg+emsg]) ;
+                   MPI_COMM_WORLD, &domain.sendRequest[pmsg+emsg]) ;*(destAddr) = 9736282;
          ++emsg ;
       }
 
